In [1]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  0.650722  0.672534
1    a  two -1.118865  1.049975
2    b  one  1.043903  0.725616
3    b  two  1.309329  0.054261
4    a  one -0.405228 -1.731377

In [5]:
#serialGroupby物件
grouped1 = df['data1'].groupby(['台北','台北','台北','台中','台中'])
grouped1.mean()

台中    0.452051
台北    0.191920
Name: data1, dtype: float64

In [7]:
df['data1'].groupby(df['key1']).sum()

key1
a   -0.873371
b    2.353232
Name: data1, dtype: float64

In [9]:
df['data1'].groupby(df['key2']).sum()

key2
one    1.289397
two    0.190464
Name: data1, dtype: float64

In [13]:
s1 = df['data1'].groupby([df['key1'],df['key2']]).sum()

In [14]:
s1.unstack()

key2       one       two
key1
a     0.245494 -1.118865
b     1.043903  1.309329

In [15]:
#DataFrameGroupby物件
df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  0.245877  0.901932
1    a  two  0.005295  0.810520
2    b  one  1.139185 -0.469812
3    b  two -0.801012 -1.192920
4    a  one  0.131285 -0.205263

In [17]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.127486  0.502397
b     0.169087 -0.831366

In [18]:
df.groupby('key2').mean()

         data1     data2
key2
one   0.505449  0.075619
two  -0.397858 -0.191200

In [19]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one   0.188581  0.348335
     two   0.005295  0.810520
b    one   1.139185 -0.469812
     two  -0.801012 -1.192920